#주어진 문자열(공백 없이 쉼표로 구분되어 있음)을 가지고 아래 문제에 대한 프로그램을 작성하세요.

#이유덕,이재영,권종표,이재영,박민호,강상희,이재영,김지완,최승혁,이성연,박영서,박민호,전경헌,송정환,김재성,이유덕,전경헌

#김씨와 이씨는 각각 몇 명 인가요?
#"이재영"이란 이름이 몇 번 반복되나요?
#중복을 제거한 이름을 출력하세요.
#중복을 제거한 이름을 오름차순으로 정렬하여 출력하세요.

names = "이유덕,이재영,권종표,이재영,박민호,강상희,이재영,김지완,최승혁,이성연,박영서,박민호,전경헌,송정환,김재성,이유덕,전경헌".split(",")

a=[ i[0] for i in names ]
print("김씨 : %d\n이씨 : %d\n"%(a.count("김"), a.count("이")))

print("이재영의 수 : %d명"%(names.count("이재영")))

b = set(names) #중복제거한 이름
print(b)

c = list(b)
c.sort() #오름차순 정렬
print(c)
